wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_edim_endat.c
    reg_tmp = EDIM_ENDAT_CFG0;
    reg_tmp &= (~(EDIM_ENDAT_CFG0_DFEN0 | EDIM_ENDAT_CFG0_DFEN1 | EDIM_ENDAT_CFG0_DFEN2 | EDIM_ENDAT_CFG0_DFEN3));
    reg_tmp |= (reg_selected & (EDIM_ENDAT_CFG0_DFEN0 | EDIM_ENDAT_CFG0_DFEN1 | EDIM_ENDAT_CFG0_DFEN2 | EDIM_ENDAT_CFG0_DFEN3));
    EDIM_ENDAT_CFG0 = reg_tmp;
}

/*!
    \brief      read EnDat slave data with low 32bit (API_ID(0x001AU))
    \param[in]  none
    \param[out] none
    \retval     slave data with low 32bit: 0~0xFFFFFFFF
*/
uint32_t edim_endat_data_low_read(void)
{
    return EDIM_ENDAT_RDATA0;
}

/*!
    \brief      read EnDat encoder data (API_ID(0x001BU))
    \param[in]  none
    \param[out] none
    \retval     64bit encoder data: 0~0xFFFFFFFFFFFFFFFF
*/
uint64_t edim_endat_data_read(void)
{
    uint64_t reg1;
    uint64_t reg2;
    reg1 = (uint64_t)EDIM_ENDAT_RDATA0;
    reg2 = (((uint64_t)EDIM_ENDAT_RDATA1 & 0x000000000000FFFFU) << 32U);
    return (reg1 | reg2);
}

/*!
    \brief      read EnDat CRC bit in the received data (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     received crc of data: 0~0x1F
*/
uint8_t edim_endat_crc_of_data_read(void)
{
    return (uint8_t)((EDIM_ENDAT_RDATA1 & 0x001F0000U) >> 16U);
}

/*!
    \brief      read EnDat F1 bit in the received data (API_ID(0x001DU))
    \param[in]  none
    \param[out] none
    \retval     received f1 of data: 0~0x01
*/
uint8_t edim_endat_f1_of_data_read(void)
{
    return (uint8_t)((EDIM_ENDAT_RDATA1 & 0x00200000U) >> 21U);
}

/*!
    \brief      read EnDat inverse of F2 bit in the received data (API_ID(0x001EU))
    \param[in]  none
    \param[out] none
    \retval     received the inverse f2 of data: 0~0x01
*/
uint8_t edim_endat_inverse_f2_of_data_read(void)
{
    return (uint8_t)((EDIM_ENDAT_RDATA1 & 0x00400000U) >> 22U);
}

/*!
    \brief      read EnDat encoder data from additional information 1 (API_ID(0x001FU))
    \param[in]  none
    \param[out] none
    \retval     received data of additional information 1: 0~0xFFFF
*/
uint16_t edim_endat_addtional_info_1_data_read(void)
{
    return (uint16_t)(EDIM_ENDAT_RDATA3 & 0x0000FFFFU);
}

/*!
    \brief      read EnDat encoder data from additional information 2 (API_ID(0x0020U))
    \param[in]  none
    \param[out] none
    \retval     received data of additional information 2: 0~0xFFFF
*/
uint16_t edim_endat_addtional_info_2_data_read(void)
{
    return (uint16_t)(EDIM_ENDAT_RDATA2 & 0x0000FFFFU);
}

/*!
    \brief      initialize EDIM_ENDAT addtional information struct with a default value (API_ID(0x0021U))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void edim_endat_addtional_info_struct_para_init(edim_endat_addtional_info_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(EDIM_ENDAT_MODULE_ID, API_ID(0x0021U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        initpara->crc = 0U;
        initpara->data = 0U;
        initpara->mrs_addr = 0U;
    }
}

/*!
    \brief      read entire EnDat encoder additional information 1 (API_ID(0x0022U))
    \param[in]  none
    \param[out] add_info: pointer to address to store addtional information 1
    \retval     none
*/
void edim_endat_addtional_info_1_read(edim_endat_addtional_info_struct *add_info)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(add_info)) {
        fw_debug_report_err(EDIM_ENDAT_MODULE_ID, API_ID(0x0022U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t tmp = EDIM_ENDAT_RDATA3;
        add_info->crc       = (uint8_t)((tmp & EDIM_ENDAT_RDATA3_CRCADD1) >> EDIM_ENDAT_ADDINFO_CRC_OFFSET);
        add_info->mrs_addr  = (uint8_t)((tmp & EDIM_ENDAT_RDATA3_MRSADD1) >> EDIM_ENDAT_ADDINFO_MRS_OFFSET);
        add_info->data      = (uint16_t)(tmp & EDIM_ENDAT_RDATA3_DATAADD1);
    }
}

/*!
    \brief      read entire EnDat encoder additional information 2 (API_ID(0x0023U))
    \param[in]  none
    \param[out] add_info: pointer to address to store addtional information 2
    \retval     none
*/
void edim_endat_addtional_info_2_read(edim_endat_addtional_info_struct *add_info)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(add_info)) {
        fw_debug_report_err(EDIM_ENDAT_MODULE_ID, API_ID(0x0023U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t tmp = EDIM_ENDAT_RDATA2;
        add_info->crc       = (uint8_t)((tmp & EDIM_ENDAT_RDATA2_CRCADD2) >> EDIM_ENDAT_ADDINFO_CRC_OFFSET);
        add_info->mrs_addr  = (uint8_t)((tmp & EDIM_ENDAT_RDATA2_MRSADD2) >> EDIM_ENDAT_ADDINFO_MRS_OFFSET);
        add_info->data      = (uint16_t)(tmp & EDIM_ENDAT_RDATA2_DATAADD2);
    }
}

/*!
    \brief      enable the EnDat interrupt (API_ID(0x0024U))
    \param[in]  interrupt: specify which interrupt to enable
                one or more parameters can be selected which are shown as below:
      \arg        EDIM_ENDAT_INT_RDATAUP: EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update interrupt
      \arg        EDIM_ENDAT_INT_ERR1: error message 1 interrupt
      \arg        EDIM_ENDAT_INT_CRC: CRC error for received data interrupt
      \arg        EDIM_ENDAT_INT_TYPE1: type I error interrupt
      \arg        EDIM_ENDAT_INT_TYPE2: type II error interrupt
      \arg        EDIM_ENDAT_INT_MRSADDR: MRS code or address  error interupt enable
      \arg        EDIM_ENDAT_INT_RDATA2UP: EDIM_ENDAT_RDATA2 registers update interrupt
      \arg        EDIM_ENDAT_INT_RDATA3UP: EDIM_ENDAT_RDATA3 registers update interrupt
      \arg        EDIM_ENDAT_INT_ERR2: error message 2 interrupt
      \arg        EDIM_ENDAT_INT_CRCADD1: CRC error for addtional information 1 interrupt
      \arg        EDIM_ENDAT_INT_CRCADD2: CRC error for addtional information 2 interrupt
      \arg        EDIM_ENDAT_INT_BUSY: BUSY bit in EnDat protocol set interrupt
      \arg        EDIM_ENDAT_INT_RM: RM bit in EnDat protocol set interrupt
      \arg        EDIM_ENDAT_INT_WRN: WRN bit in EnDat protocol set interrupt
      \arg        EDIM_ENDAT_INT_SPIKE: spike detection interrupt
      \arg        EDIM_ENDAT_INT_TO: frame transmission timeout interrupt
      \arg        EDIM_ENDAT_INT_TYPE3: type III error interrupt
      \arg        EDIM_ENDAT_INT_FIFOOVR: dma overrun error interrupt
      \arg        EDIM_ENDAT_INT_FIFOUNR: dma underrun error interrupt
      \arg        EDIM_ENDAT_INT_DMATO: dma request timeout interrupt
      \arg        EDIM_ENDAT_INT_DATACHK: all check have been performed and status is updated interrupt
    \param[out] none
    \retval     none
*/
void edim_endat_interrupt_enable(uint32_t interrupt)
{
    EDIM_ENDAT_INTEN |= (interrupt & EDIM_ENDAT_INTEN_MASK);
}

/*!
    \brief      disable the EnDat interrupt (API_ID(0x0025U))
    \param[in]  interrupt: specify which interrupt to enable
                one or more parameters can be selected which are shown as below:
      \arg        EDIM_ENDAT_INT_RDATAUP: EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update interrupt
      \arg        EDIM_ENDAT_INT_ERR1: error message 1 interrupt
      \arg        EDIM_ENDAT_INT_CRC: CRC error for received data interrupt
      \arg        EDIM_ENDAT_INT_TYPE1: type I error interrupt
      \arg        EDIM_ENDAT_INT_TYPE2: type II error interrupt
      \arg        EDIM_ENDAT_INT_MRSADDR: MRS code or address  error interupt enable
      \arg        EDIM_ENDAT_INT_RDATA2UP: EDIM_ENDAT_RDATA2 registers update interrupt
      \arg        EDIM_ENDAT_INT_RDATA3UP: EDIM_ENDAT_RDATA3 registers update interrupt
      \arg        EDIM_ENDAT_INT_ERR2: error message 2 interrupt
      \arg        EDIM_ENDAT_INT_CRCADD1: CRC error for addtional information 1 interrupt
      \arg        EDIM_ENDAT_INT_CRCADD2: CRC error for addtional information 2 interrupt
      \arg        EDIM_ENDAT_INT_BUSY: BUSY bit in EnDat protocol set interrupt
      \arg        EDIM_ENDAT_INT_RM: RM bit in EnDat protocol set interrupt
      \arg        EDIM_ENDAT_INT_WRN: WRN bit in EnDat protocol set interrupt
      \arg        EDIM_ENDAT_INT_SPIKE: spike detection interrupt
      \arg        EDIM_ENDAT_INT_TO: frame transmission timeout interrupt
      \arg        EDIM_ENDAT_INT_TYPE3: type III error interrupt
      \arg        EDIM_ENDAT_INT_FIFOOVR: dma overrun error interrupt
      \arg        EDIM_ENDAT_INT_FIFOUNR: dma underrun error interrupt
      \arg        EDIM_ENDAT_INT_DMATO: dma request timeout interrupt
      \arg        EDIM_ENDAT_INT_DATACHK: all check have been performed and status is updated interrupt
    \param[out] none
    \retval     none
*/
void edim_endat_interrupt_disable(uint32_t interrupt)
{
    EDIM_ENDAT_INTEN &= (~(interrupt & EDIM_ENDAT_INTEN_MASK));
}

/*!
    \brief      get EnDat flag (API_ID(0x0026U))
    \param[in]  flag: EDIM_ENDAT flag
                one or more parameters can be selected which are shown as below:
      \arg        EDIM_ENDAT_FLAG_RDATAUP: EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update flag
      \arg        EDIM_ENDAT_FLAG_ERR1: error message 1 flag
      \arg        EDIM_ENDAT_FLAG_CRC: CRC error for received data flag
      \arg        EDIM_ENDAT_FLAG_TYPE1: type I error interrupt flag
      \arg        EDIM_ENDAT_FLAG_TYPE2: type II error interrupt flag
      \arg        EDIM_ENDAT_FLAG_MRSADDR: MRS or address error interrupt flag
      \arg        EDIM_ENDAT_FLAG_RDATA2UP: EDIM_ENDAT_RDATA2 registers update interrupt flag
      \arg        EDIM_ENDAT_FLAG_RDATA3UP: EDIM_ENDAT_RDATA3 registers update interrupt flag
      \arg        EDIM_ENDAT_FLAG_ERR2: error message 1 flag
      \arg        EDIM_ENDAT_FLAG_CRCADD1: CRC error for addtional information 1 flag
      \arg        EDIM_ENDAT_FLAG_CRCADD2: CRC error for addtional information 2 flag
      \arg        EDIM_ENDAT_FLAG_BUSY: BUSY bit in EnDat protocol
      \arg        EDIM_ENDAT_FLAG_RM: RM bit in EnDat protocol
      \arg        EDIM_ENDAT_FLAG_WRN: WRN bit in EnDat protocol
      \arg        EDIM_ENDAT_FLAG_SPIKE: spike detection flag
      \arg        EDIM_ENDAT_FLAG_TO: frame transmission timeout flag
      \arg        EDIM_ENDAT_FLAG_TYPE3: type III error interrupt flag
      \arg        EDIM_ENDAT_FLAG_DTC: propagation time compensation flag
      \arg        EDIM_ENDAT_FLAG_PTMC: propagation time measurement complete flag
      \arg        EDIM_ENDAT_FLAG_FIFOOVR: dma overrun error flag
      \arg        EDIM_ENDAT_FLAG_FIFOUNR: dma underrun error flag
      \arg        EDIM_ENDAT_FLAG_DMATO: dma request timeout flag
      \arg        EDIM_ENDAT_FLAG_NEXTRDY: next transmission ready flag
      \arg        EDIM_ENDAT_FLAG_DATACHK: all check have been performed and status is updated flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_endat_flag_get(uint32_t flag)
{
    FlagStatus return_val = RESET;
    if(RESET != (EDIM_ENDAT_STAT & flag)) {
        return_val = SET;
    } else {
        return_val = RESET;
    }
    return return_val;
}

/*!
    \brief      clear EnDat flag (API_ID(0x0027U))
    \param[in]  flag: EDIM_ENDAT flag
                one or more parameters can be selected which are shown as below:
      \arg        EDIM_ENDAT_FLAG_RDATAUP: EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update flag
      \arg        EDIM_ENDAT_FLAG_ERR1: error message 1 flag
      \arg        EDIM_ENDAT_FLAG_CRC: CRC error for received data flag
      \arg        EDIM_ENDAT_FLAG_TYPE1: type I error interrupt flag
      \arg        EDIM_ENDAT_FLAG_TYPE2: type II error interrupt flag
      \arg        EDIM_ENDAT_FLAG_MRSADDR: MRS or address error interrupt flag
      \arg        EDIM_ENDAT_FLAG_RDATA2UP: EDIM_ENDAT_RDATA2 registers update interrupt flag
      \arg        EDIM_ENDAT_FLAG_RDATA3UP: EDIM_ENDAT_RDATA3 registers update interrupt flag
      \arg        EDIM_ENDAT_FLAG_ERR2: error message 1 flag
      \arg        EDIM_ENDAT_FLAG_CRCADD1: CRC error for addtional information 1 flag
      \arg        EDIM_ENDAT_FLAG_CRCADD2: CRC error for addtional information 2 flag
      \arg        EDIM_ENDAT_FLAG_BUSY: BUSY bit in EnDat protocol
      \arg        EDIM_ENDAT_FLAG_RM: RM bit in EnDat protocol
      \arg        EDIM_ENDAT_FLAG_WRN: WRN bit in EnDat protocol
      \arg        EDIM_ENDAT_FLAG_SPIKE: spike detection flag
      \arg        EDIM_ENDAT_FLAG_TO: frame transmission timeout flag
      \arg        EDIM_ENDAT_FLAG_TYPE3: type III error interrupt flag
      \arg        EDIM_ENDAT_FLAG_DTC: propagation time compensation flag
      \arg        EDIM_ENDAT_FLAG_PTMC: propagation time measurement complete flag
      \arg        EDIM_ENDAT_FLAG_FIFOOVR: dma overrun error flag
      \arg        EDIM_ENDAT_FLAG_FIFOUNR: dma underrun error flag
      \arg        EDIM_ENDAT_FLAG_DMATO: dma request timeout flag
      \arg        EDIM_ENDAT_FLAG_NEXTRDY: next transmission ready flag
      \arg        EDIM_ENDAT_FLAG_DATACHK: all check have been performed and status is updated flag
    \param[out] none
    \retval     none
*/
void edim_endat_flag_clear(uint32_t flag)
{
    EDIM_ENDAT_STAT = (flag & EDIM_ENDAT_FLAG_MASK);
}

/*!
    \brief      get EnDat interrupt flag (API_ID(0x0028U))
    \param[in]  int_flag: EDIM_ENDAT interrupt flag
                only one parameters can be selected which are shown as below:
      \arg        EDIM_ENDAT_INT_FLAG_RDATAUP: EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_ERR1: error message 1 interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_CRC: CRC error for received data interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_TYPE1: type I error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_TYPE2: type II error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_MRSADDR: MRS code or address  error interupt enable
      \arg        EDIM_ENDAT_INT_FLAG_RDATA2UP: EDIM_ENDAT_RDATA2 registers update interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_RDATA3UP: EDIM_ENDAT_RDATA3 registers update interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_ERR2: error message 2 interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_CRCADD1: CRC error for addtional information 1 interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_CRCADD2: CRC error for addtional information 2 interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_BUSY: BUSY bit in EnDat protocol set interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_RM: RM bit in EnDat protocol set interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_WRN: WRN bit in EnDat protocol set interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_SPIKE: spike detection interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_TO: frame transmission timeout interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_TYPE3: type III error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_FIFOOVR: dma overrun error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_FIFOUNR: dma underrun error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_DMATO: dma request timeout interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_DATACHK: all check have been performed and status is updated interrupt flag
    \param[out] none
    \retval     none
*/
FlagStatus edim_endat_interrupt_flag_get(edim_endat_interrupt_flag_enum int_flag)
{
    uint32_t ret1 = RESET;
    uint32_t ret2 = RESET;
    FlagStatus return_val = RESET;

