wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_edim_endat.c
    /* get the status of interrupt enable bit  */
    ret1 = (EDIM_ENDAT_REG_VAL(EDIM_ENDAT, int_flag) & BIT(EDIM_ENDAT_BIT_POS(int_flag)));
    /* get the status of interrupt flag */
    ret2 = (EDIM_ENDAT_REG_VAL2(EDIM_ENDAT, int_flag) & BIT(EDIM_ENDAT_BIT_POS2(int_flag)));
    
    if(ret1 && ret2) {
        return_val = SET;
    } else {
        return_val = RESET;
    }
    return return_val;
}

/*!
    \brief      clear EnDat interrupt flag (API_ID(0x0029U))
    \param[in]  interrupt: specify which interrupt to enable
                one or more parameters can be selected which are shown as below:
      \arg        EDIM_ENDAT_INT_FLAG_RDATAUP: EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_ERR1: error message 1 interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_CRC: CRC error for received data interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_TYPE1: type I error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_TYPE2: type II error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_MRSADDR: MRS code or address  error interupt enable
      \arg        EDIM_ENDAT_INT_FLAG_RDATA2UP: EDIM_ENDAT_RDATA2 registers update interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_RDATA3UP: EDIM_ENDAT_RDATA3 registers update interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_ERR2: error message 2 interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_CRCADD1: CRC error for addtional information 1 interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_CRCADD2: CRC error for addtional information 2 interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_BUSY: BUSY bit in EnDat protocol set interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_RM: RM bit in EnDat protocol set interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_WRN: WRN bit in EnDat protocol set interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_SPIKE: spike detection interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_TO: frame transmission timeout interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_TYPE3: type III error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_FIFOOVR: dma overrun error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_FIFOUNR: dma underrun error interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_DMATO: dma request timeout interrupt flag
      \arg        EDIM_ENDAT_INT_FLAG_DATACHK: all check have been performed and status is updated interrupt flag
    \param[out] none
    \retval     none
*/
void edim_endat_interrupt_flag_clear(edim_endat_interrupt_flag_enum int_flag)
{
    EDIM_ENDAT_STAT = BIT(EDIM_ENDAT_BIT_POS2(int_flag));
}
